# Tweets in Bangkok (Siam to Grand Palace Area) visualization

lat-long: [100.484605,13.685780,100.584605,13.785780]

## Import zone

In [55]:
import pandas as pd
from mtranslate import translate
import pickle

## function zone

In [43]:
def trans_to_en(word):
    translate(word,'en')

In [61]:
def save_obj(file, obj):
    with open(file, 'wb') as f:
        pickle.dump(obj, f)

def load_obj(file, obj):
    with open(file, 'rb') as f:
        obj = pickle.load(f)

## Data zone

In [29]:
f = open('BKK_th-en_tweets_gamcom.txt','r',encoding='utf-8')

In [30]:
tweet_list = []
for line in f:
    tweet_list.append(line.split('\t'))

In [31]:
print(tweet_list[0])

['58872847', 'amp_cuband', '1001468679140270080', '@jjiab จริงค่ะ ส่วนตัวคิดว่าแบบนั้นดีแล้ว', '2018-05-29 14:21:54', '-1', '-1', 'Sathon', '100.508189, 13.700842', '100.553474, 13.725971', 'th\n']

In [32]:
labels = ['acc_id','acc','tweet_id','text','created_time','ex_lat','ex_long','place','lot_sw','lot_ne','lang']
tweet_df = pd.DataFrame(tweet_list,columns=labels)

In [33]:
tweet_df['lang'] = tweet_df['lang'].apply(lambda x: x.strip())

In [34]:
tweet_df.head()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
0,58872847,amp_cuband,1001468679140270080,@jjiab จริงค่ะ ส่วนตัวคิดว่าแบบนั้นดีแล้ว,2018-05-29 14:21:54,-1,-1,Sathon,"100.508189, 13.700842","100.553474, 13.725971",th
1,168438587,Porschephranot,1001468684752248834,@mju_zik ว่าไงจ๊ะ,2018-05-29 14:21:55,-1,-1,Rong Mueang,"100.515532, 13.735617","100.524483, 13.75308",th
2,260726562,mangokarn,1001468689105936384,@eyejaekris อร่อยยยยยย,2018-05-29 14:21:56,-1,-1,สาทร,"100.514643, 13.700842","100.537444, 13.715906",th
3,2668781561,__hxnxx,1001468699784634369,As much as I feel saddened by Ali Banats death...,2018-05-29 14:21:59,-1,-1,กรุงเทพมหานคร,"100.327737, 13.494097","100.938408, 13.955111",en
4,104415934,devoteraphar,1001468727756574720,"I'm at Police General Hospital in Pathum Wan, ...",2018-05-29 14:22:05,13.74321493,100.53976065,Pathum Wan,"100.528375, 13.72951","100.541027, 13.749708",en

In [35]:
tweet_df.describe()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
count,2660,2660,2660,2660,2660,2660,2660,2660,2660,2660,2660
unique,1127,1128,2660,2659,2526,85,85,139,87,86,2
top,144851766,SiRiPALIT,1001510464306561024,หิว,2018-05-29 16:07:56,-1,-1,Myanmar,"97.343365, 5.612531","105.636107, 20.46519",th
freq,47,47,1,2,3,2553,2553,213,237,237,2147

In [36]:
tweet_df = tweet_df[tweet_df.place != 'Myanmar']
tweet_df.describe()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
count,2447,2447,2447,2447,2447,2447,2447,2447,2447,2447,2447
unique,1066,1066,2447,2446,2330,80,80,138,86,85,2
top,144851766,SiRiPALIT,1001510464306561024,หิว,2018-05-29 15:14:50,-1,-1,ประเทศไทย,"97.343365, 5.612531","105.636107, 20.46519",th
freq,47,47,1,2,3,2353,2353,138,237,237,2144

## Translating zone

In [37]:
tweet_df['place'].unique()

array(['Sathon', 'Rong Mueang', 'สาทร', 'กรุงเทพมหานคร', 'Pathum Wan',
       'ประเทศไทย', 'วชิรพยาบาล', 'Thailand', 'รองเมือง', 'Lumphini',
       'ราชเทวี', 'Din Daeng', 'Bangkok Yai', 'ปทุมวัน', 'Phra Khanong',
       'Huai Khwang', 'คลองต้นไทร', 'ลุมพินี', 'Suriya Wong', 'Silom',
       'Bang Khlo', 'Khlong Tan Nuea', 'Ratchathewi', 'Khlong Toei',
       'Bangkok', 'พญาไท', 'Samsen Nok', 'Bang Pakok', 'คลองตันเหนือ',
       'Khlong Ton Sai', 'บางมด 1', 'บางพลัด', 'Yannawa', 'พระโขนงเหนือ',
       'วังใหม่', 'ถนนเพชรบุรี', 'ดินแดง', 'บางโพงพาง', 'พระโขนง',
       'Thanon Phaya Thai', 'Khlong San', 'Bang Bumru', 'Bukkhalo',
       'มักกะสัน', 'Wachira Phayaban', 'บางขุนพรหม', 'Phaya Thai',
       'Phra Khanong Nuea', 'สีลม', 'บางกอกใหญ่', 'Wang Mai',
       'Wat Phraya Krai', 'บางกะปิ', 'คลองสาน', 'Makkasan', 'ตลาดน้อย',
       'อ.พระประแดง', 'มหาพฤฒาราม', 'ดุสิต', 'Talat Noi', 'ห้วยขวาง',
       'Thung Maha Mek', 'Bang Phong Phang', 'วัดพระยาไกร', 'สามเสนนอก',
       'Ban Bat', 'Thanon Phetchaburi', 'บุคคโล', 'Vadhana', 'Si Phraya',
       'Chom Thong', 'Bang Lamphu Lang', 'ทุ่งมหาเมฆ',
       'Pom Prap Sattru Phai', 'Bangkok Noi', 'ถนนนครไชยศรี',
       'Bang Phlat', 'วัดราชบพิธ', 'Khlong Tan', 'Dao Khanong', 'วัฒนา',
       'Bang Kapi', 'ยานนาวา', 'ถนนพญาไท', 'Arun Amarin', 'บางยี่ขัน',
       'Bang Rak', 'Bang Khun Phrom', 'Thanon Nakhon Chai Si', 'สี่พระยา',
       'สุริยวงศ์', 'คลองเตย', 'บางลำภูล่าง', 'อรุณอมรินทร์',
       'Wang Burapha Phirom', 'บางโคล่', 'Samre', 'ราษฎร์บูรณะ', 'จอมทอง',
       'คลองตัน', 'Bang Mot 1', 'บางกอกน้อย', 'Talat Yot', 'บางกะเจ้า',
       'Si Yaek Maha Nak', 'สำเหร่', 'Phra Borom Maha Ratchawang',
       'Bang Kho Laem', 'Bang Yi Khan', 'Bowon Niwet', 'Dusit',
       'Maha Phruttharam', 'บางบำหรุ', 'Samran Rat', 'Wat Arun',
       'Ban Phan Thom', 'บางปะกอก', 'Samphanthawong', 'บางคอแหลม',
       'สมเด็จเจ้าพระยา', 'ดาวคะนอง', 'หิรัญรูจี', 'พระบรมมหาราชวัง',
       'Hiranruchi', 'Suan Chitlada', 'พระนคร', 'Wat Ratchabophit',
       'Wat Thep Sirin', 'คลองมหานาค', 'สวนจิตรลดา', 'Wat Kanlaya',
       'ป้อมปราบศัตรูพ่าย', 'บางรัก', 'Thon Buri', 'วัดอรุณ',
       'วัดกัลยาณ์', 'ธนบุรี', 'Wat Sam Phraya'], dtype=object)

In [41]:
print(translate('พระบรมมหาราชวัง','en'))

Grand Palace

In [52]:
#tweet_df['acc'] = tweet_df['acc'].apply(lambda x: translate(x,'en'))

In [50]:
#tweet_df['place'] = tweet_df['place'].apply(lambda x: translate(x,'en'))

In [51]:
#tweet_df['textt'] = tweet_df['text'].apply(lambda x: translate(x,'en'))

In [57]:
#save_obj('translated_tweet', tweet_df)

In [67]:
with open('translated_tweet','rb') as f:
    tweet_df = pickle.load(f)

In [68]:
tweet_df.head()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
0,58872847,amp_cuband,1001468679140270080,@jjiab I personally think that's fine.,2018-05-29 14:21:54,-1,-1,Sathon,"100.508189, 13.700842","100.553474, 13.725971",th
1,168438587,Porschephranot,1001468684752248834,@mj_zik,2018-05-29 14:21:55,-1,-1,Rong Mueang,"100.515532, 13.735617","100.524483, 13.75308",th
2,260726562,mangokarn,1001468689105936384,Thanks for sharing!,2018-05-29 14:21:56,-1,-1,Sathorn,"100.514643, 13.700842","100.537444, 13.715906",th
3,2668781561,__hxnxx,1001468699784634369,As much as I feel saddened by Ali Banats death...,2018-05-29 14:21:59,-1,-1,Bangkok,"100.327737, 13.494097","100.938408, 13.955111",en
4,104415934,devoteraphar,1001468727756574720,"I'm at Police General Hospital in Pathum Wan, ...",2018-05-29 14:22:05,13.74321493,100.53976065,Pathum Wan,"100.528375, 13.72951","100.541027, 13.749708",en

## clean some places

In [100]:
tweet_df['place'].value_counts()

Thailand                      237
Din Daeng                     161
Phra Khanong                  118
Ratchathewi                   114
Bangkok                       113
Phaya Thai                     65
Lumphini                       65
Sathorn                        58
Briefly                        53
Huai Khwang                    50
Phayathai                      49
Yannawa                        48
Khlong Toei                    47
Arun Amarin                    44
Bang Phlat                     42
North Klongton                 39
Makkasan                       35
Bangyikhan                     34
Khlong San                     33
Sathon                         32
Khlong Tan Nuea                31
Samsennok                      29
Chom Thong                     29
Rong Mueang                    29
Pathumwan                      28
Thanon Phaya Thai              27
Khlong Ton Sai                 26
windmill                       26
Vadhana                        25
Wattana                        25
                             ...
Dao                             4
Ban Phan Thom                   4
Bang Mot 1                      4
Somdej Chao Phraya              3
Suriyawongse                    3
Hiranruchi                      3
Chitralada Garden               3
Suriya Wong                     3
New Palace                      3
Wat Kanlaya                     3
Khlong Mahanak                  2
What Arun                       2
Ratburana                       2
Yaek Maha Nak                   2
Virgin                          2
Thonburi                        2
Mahidol                         2
Phra Pradaeng                   2
Samran Rat                      2
Grand Palace                    2
Some                            1
Wat Sam Phraya                  1
capital                         1
Wat Thep Sirin                  1
Samphanthawong                  1
Phra Borom Maha Ratchawang      1
Bang rak                        1
Wat Kalay                       1
Arun temple                     1
Thon Buri                       1
Name: place, Length: 120, dtype: int64

In [103]:
tweet_df = tweet_df[tweet_df['place']!='Thailand']
tweet_df = tweet_df[tweet_df['place']!='Bangkok']

## check duplicated tweet_id

In [134]:
len(tweet_df['tweet_id']) == len(set(tweet_df['tweet_id']))

True

## Seperate languages

In [104]:
tweet_en = tweet_df[tweet_df.lang=='en']
tweet_th = tweet_df[tweet_df.lang=='th']

In [105]:
tweet_en.describe()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
count,261,261,261,261,261,261,261,261,261,261,261
unique,170,170,261,261,259,55,54,67,58,57,1
top,983194539048480769,preshtawiah,1001622501053550593,@IDFSpokesperson @NYCREMilton This is sad.,2018-05-30 00:37:26,-1,-1,Khlong Toei,"100.55061, 13.697698","100.588204, 13.742692",en
freq,21,21,1,1,2,199,199,31,34,34,261

In [106]:
tweet_th.describe()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
count,1836,1836,1836,1836,1836,1836,1836,1836,1836,1836,1836
unique,746,746,1836,1639,1776,20,21,111,81,80,1
top,144851766,SiRiPALIT,1001510464306561024,I'm not sure what to say.,2018-05-29 15:19:24,-1,-1,Din Daeng,"100.54335, 13.755095","100.574668, 13.800937",th
freq,47,47,1,37,3,1813,1813,153,153,153,1836

## Looking at 4Square

In [117]:
tweet_df.text[4]

"I'm at Police General Hospital in Pathum Wan, Bangkok https://t.co/cnAdRvQGW8"

In [122]:
tweet_th['text'].apply(lambda x: "I'm at" in x).value_counts()

False    1828
True        8
Name: text, dtype: int64

In [126]:
tweet_th[tweet_th['text'].apply(lambda x: "I'm at" in x)]['text']

2046               I'm at Bangkok https://t.co/JAPtVh2Bp5
2060      I'm at Makkasan Railway https://t.co/dLC8qUNL04
2326    I'm at Mahaphant Building, 88th Birthday Anniv...
2384    I'm at a bloody rice pudding with seaweed w / ...
2430    I'm at rice, blood, pig, mushroom, seaweed w /...
2452    I'm at Chulalongkorn Hospital in Bangkok, Bang...
2493                                    I'm at Das Prada.
2572    I'm at home, kindheartedly https://t.co/xybHoI...
Name: text, dtype: object

In [129]:
tweet_en['text'].apply(lambda x: "I'm at" in x).value_counts()

False    217
True      44
Name: text, dtype: int64

In [128]:
tweet_en[tweet_en['text'].apply(lambda x: "I'm at" in x)]['text']

4       I'm at Police General Hospital in Pathum Wan, ...
217     I'm at stronghold boardgame cafe https://t.co/...
221     I'm at Butcher Beef &amp; Beer in Bang Kho Lae...
265     I'm at Asiatique The Riverfront in Bang Kho La...
276     I'm at K.S.RESIDENCE in Bang Phlat, Bangkok ht...
368     I'm at CTH Dormitory in Bangkok, Thailand http...
468     I'm at Prime Sathorn Residence in Bangkok http...
1125    I'm at @BigCThailand in Pathum Wan, Bangkok ht...
1445         I'm at Bar Next Door https://t.co/qNs1znDdnj
1476    I'm at The Sense Pinklao in Bangkok Noi, Thail...
1627    I'm at Scratch Dog in Khlong Toei, Bangkok htt...
1792    I'm at The Street in Din Daeng, Bangkok https:...
1985    I'm at Foodland in Din Daeng, Bangkok https://...
2042    I'm at Bangkok Marriott Hotel The Surawongse i...
2116    I'm at Bang Phlat Intersection in Bang Phlat, ...
2137    I'm at Wattana Wittaya Academy in Vadhana, Ban...
2188    I'm at Rajinibon School in Dusit, Bangkok w / ...
2192    I'm at Wattana Wittaya Academy in Vadhana, Ban...
2221    I'm at Victory Monument in Ratchathewi, Bangko...
2237    I'm at Taksin Intersection in Thon Buri, Bangk...
2247    I'm at BTS Pho Nimit - @bts_skytrain in Thon B...
2266    I'm at Y Rooms &amp; Spa in Khlong Toei https:...
2291    I'm at BRT Thanon Chan - @bangkokbrt in Sathon...
2312    I'm at Embassy of the United States of America...
2316    I'm at Assumption Convent School in Bang Rak, ...
2334    I'm at Rajavithi Hospital in Ratchathewi, Bang...
2340    I'm at Faculty of Education in Pathum Wan, Ban...
2382    I'm at BDS Performance in Bangkok https://t.co...
2389    I'm at BTS สยาม - @bts_skytrain in Pathum Wan,...
2393    I'm at Vatel International Business School in ...
2394    I'm at Bank of Thailand in Bangrak, Bangkok ht...
2407    I'm at M.O.P | Art &amp; Design Studio in Bang...
2410    I'm at Freshdrinkcafe in Thapha, Bangkok https...
2434      I'm at M.6/8 art-social https://t.co/3e6Zkr5HVs
2443    I'm at Interchange 21 in Vadhana, Bangkok http...
2453    I'm at Ploenchit Building in Pathum Wan, Bangk...
2459    I'm at Chartered Square Building in Bang Rak, ...
2532    I'm at Starbucks in Pathum Wan, Bangkok https:...
2536    I'm at Lido in Pathum Wan, Bangkok https://t.c...
2538    I'm at VRX - Ultimate VR Experience in Bangkok...
2563    I'm at วราภรณ์ (MANTOU PASSION) https://t.co/e...
2565    I'm at วราภรณ์ (MANTOU PASSION) w/ @punchpcp h...
2646    I'm at Siam Square in Pathum Wan, Bangkok http...
2659    I'm at Thailand Convention and Exhibition Bure...
Name: text, dtype: object